Documents/ИсполнениеОбязательствПоСделкеСПФИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентныйПлатежВходящий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентныйПлатежИсходящий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершениеСделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСПФИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИсполнениеОбязательствПоСделкеСПФИ/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиДенежныхСредств");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Брокер",                	    Справочники.БрокерскиеКомпании.ПустаяСсылка());
	ЭлементБлокировкиДанных.УстановитьЗначение("МестоХранения",                	Справочники.МестаХранения.ВнебиржевойРынок);
	ЭлементБлокировкиДанных.УстановитьЗначение("Валюта",                		ЭтотОбъект.Валюта);

	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ЗаполнитьДвижения(ВидДвижения, Сумма)

	Если ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
		ДвижениеДС = ЭтотОбъект.Движения.ОстаткиДенежныхСредств.ДобавитьПриход();
	Иначе
		ДвижениеДС = ЭтотОбъект.Движения.ОстаткиДенежныхСредств.ДобавитьРасход();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДвижениеДС, ЭтотОбъект, "Организация, СчетДоверительногоУправления, Брокер, МестоХранения, Валюта");
	ДвижениеДС.Период = ЭтотОбъект.Дата;
	ДвижениеДС.Сумма = Сумма;
	ДвижениеДС.ВидДвиженияДенежныхСредств = Перечисления.ВидыДвиженийДенежныхСредств.Оплата;
	
	ДвижениеЗД = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
	ЗаполнитьЗначенияСвойств(ДвижениеЗД, ДвижениеДС, "Период, Организация, СчетДоверительногоУправления, Валюта, Сумма");
	ДвижениеЗД.ТипЗадолженности = ?(ВидДвижения = Перечисления.ВидыДвижений.Приход, Перечисления.ТипыЗадолженности.Дебиторская, Перечисления.ТипыЗадолженности.Кредиторская);
	ДвижениеЗД.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоСделке;
	ДвижениеЗД.Контрагент = ЭтотОбъект.Основание.Контрагент;
	ДвижениеЗД.Основание = ЭтотОбъект.Основание;
	
	ЗаполнитьЗначенияСвойств(Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход(), ДвижениеЗД,, "ВидДвижения");
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);

	Если ЭтотОбъект.ПроцентныйПлатежВходящий > 0 ИЛИ ЭтотОбъект.ПроцентныйПлатежИсходящий > 0 Тогда
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
		
		Если ЭтотОбъект.ПроцентныйПлатежВходящий > 0 Тогда
			ЗаполнитьДвижения(Перечисления.ВидыДвижений.Приход, ЭтотОбъект.ПроцентныйПлатежВходящий);
		КонецЕсли;
		
		Если ЭтотОбъект.ПроцентныйПлатежИсходящий > 0 Тогда
			ЗаполнитьДвижения(Перечисления.ВидыДвижений.Расход, ЭтотОбъект.ПроцентныйПлатежИсходящий);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура СформироватьПроводкуДвиженияДС(ПараметрыПроводки)

	//СПФИ, Контрагент, СчетДС, ВидСубконтоДС, СубконтоДС, СуммаДвиженияДС, Валюта, КоррСчет, ВидДвиженияДенежныхСредств, Описание
	
	Если ПараметрыПроводки.СуммаДвиженияДС > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ПараметрыПроводки.СуммаДвиженияДС, ПараметрыПроводки.Описание);
		
		Проводка.СчетДт = ПараметрыПроводки.СчетДС;
		Проводка.СубконтоДт[ПараметрыПроводки.ВидСубконтоДС] = ПараметрыПроводки.СубконтоДС;
		Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = ПараметрыПроводки.ВидДвиженияДенежныхСредств;
						
		Проводка.ВалютаДт = ПараметрыПроводки.Валюта;
		Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.СуммаДвиженияДС;
		
		
		Проводка.СчетКт = ПараметрыПроводки.КоррСчет;
		Проводка.СубконтоКт.Контрагенты = ПараметрыПроводки.Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = ПараметрыПроводки.Основание;
		
		Проводка.ВалютаКт = ПараметрыПроводки.Валюта;
		Проводка.ВалютнаяСуммаКт = ПараметрыПроводки.СуммаДвиженияДС;
		
		
	ИначеЕсли ПараметрыПроводки.СуммаДвиженияДС < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -ПараметрыПроводки.СуммаДвиженияДС, ПараметрыПроводки.Описание);
		
		Проводка.СчетДт = ПараметрыПроводки.КоррСчет;
		Проводка.СубконтоДт.Контрагенты = ПараметрыПроводки.Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыПроводки.Основание;
		
		Проводка.ВалютаДт = ПараметрыПроводки.Валюта;
		Проводка.ВалютнаяСуммаДт = -ПараметрыПроводки.СуммаДвиженияДС;
		
		
		Проводка.СчетКт = ПараметрыПроводки.СчетДС;
		Проводка.СубконтоКт[ПараметрыПроводки.ВидСубконтоДС] = ПараметрыПроводки.СубконтоДС;
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = ПараметрыПроводки.ВидДвиженияДенежныхСредств;
						
		Проводка.ВалютаКт = ПараметрыПроводки.Валюта;
		Проводка.ВалютнаяСуммаКт = -ПараметрыПроводки.СуммаДвиженияДС;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПроцентныхДоговорах;
	
	СчетДС = ПланыСчетов.Единый.РасчетыСБрокерами02; // пока предполагаем только через брокера
	ВидСубконтоДС = ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания;
	СубконтоДС = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
	
	ПараметрыПроводкиДвиженияДС = Новый Структура();
	ПараметрыПроводкиДвиженияДС.Вставить("Основание", ЭтотОбъект.Основание);
	ПараметрыПроводкиДвиженияДС.Вставить("Контрагент", ЭтотОбъект.Основание.Контрагент);
	ПараметрыПроводкиДвиженияДС.Вставить("СчетДС", СчетДС);
	ПараметрыПроводкиДвиженияДС.Вставить("ВидСубконтоДС", ВидСубконтоДС);
	ПараметрыПроводкиДвиженияДС.Вставить("СубконтоДС", СубконтоДС);
	ПараметрыПроводкиДвиженияДС.Вставить("Валюта", ЭтотОбъект.Валюта);
	
	// Платеж входящий
	Если ЭтотОбъект.ПроцентныйПлатежВходящий > 0 Тогда
		
		ПараметрыПроводкиДвиженияДС.Вставить("СуммаДвиженияДС", ЭтотОбъект.ПроцентныйПлатежВходящий);
		ПараметрыПроводкиДвиженияДС.Вставить("КоррСчет", ПланыСчетов.Единый.Расчеты08);
		ПараметрыПроводкиДвиженияДС.Вставить("ВидДвиженияДенежныхСредств", Справочники.ВидыДвиженияДенежныхСредств.ПрочиеПоступления);
		ПараметрыПроводкиДвиженияДС.Вставить("Описание", "Проценты по СВОПу");
		
		СформироватьПроводкуДвиженияДС(ПараметрыПроводкиДвиженияДС);
		
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ЭтотОбъект.ПроцентныйПлатежВходящий, "Проценты по СВОПу");
		
		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
		Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Основание.Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Основание;
		
		Проводка.ВалютаДт = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.ПроцентныйПлатежВходящий;
		
		
		Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
		Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Основание;
		
		
		// забаланс
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ЭтотОбъект.ПроцентныйПлатежВходящий, "Задолженность по процентам");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;

		// кредит
		Проводка.СчетКт = УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;

		Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.Основание;
		Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Основание;

		Проводка.ВалютаКт = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.ПроцентныйПлатежВходящий;
		
		Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПроцентыКПолучению;
		
		
		Проводка.Партия = ЭтотОбъект.Основание;
		
	КонецЕсли;
	
	// Платеж исходящий
	Если ЭтотОбъект.ПроцентныйПлатежИсходящий > 0 Тогда
		
		ПараметрыПроводкиДвиженияДС.Вставить("СуммаДвиженияДС", -ЭтотОбъект.ПроцентныйПлатежИсходящий);
		ПараметрыПроводкиДвиженияДС.Вставить("КоррСчет", ПланыСчетов.Единый.Расчеты07);
		ПараметрыПроводкиДвиженияДС.Вставить("ВидДвиженияДенежныхСредств", Справочники.ВидыДвиженияДенежныхСредств.ПрочиеВыплаты);
		ПараметрыПроводкиДвиженияДС.Вставить("Описание", "Проценты по СВОПу");
		
		СформироватьПроводкуДвиженияДС(ПараметрыПроводкиДвиженияДС);
		
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ЭтотОбъект.ПроцентныйПлатежИсходящий, "Проценты по СВОПу");
		
		Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
		Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Основание;
	
		
		Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
		Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Основание.Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Основание;
		
		Проводка.ВалютаКт = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.ПроцентныйПлатежИсходящий;
		
		// забаланс
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ЭтотОбъект.ПроцентныйПлатежИсходящий, "Задолженность по процентам");
		
		// дебет
		Проводка.СчетДт = УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;

		Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.Основание;
		Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Основание;

		Проводка.ВалютаДт = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.ПроцентныйПлатежИсходящий;
		
		Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПроцентыКУплате;

		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
		
		Проводка.Партия = ЭтотОбъект.Основание;
		
	КонецЕсли;
	

	ФинРез = ЭтотОбъект.ПроцентныйПлатежВходящий - ЭтотОбъект.ПроцентныйПлатежИсходящий;
	
	Если ФинРез > 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ФинРез, "Доход по СВОПу");
		
		Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
		Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Основание;
		
		
		Проводка.СчетКт = УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
		
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктивЕПС.АналитикаДоходовОтОпераций;
		Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.Основание;
		
	ИначеЕсли ФинРез < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -ФинРез, "Расход по СВОПу");
		
		Проводка.СчетДт = УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
		
		Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктивЕПС.АналитикаРасходовОтОпераций;
		Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.Основание;
		
		
		Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
		Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Основание;
		
	КонецЕсли;
		
	
	// Прекращение признания
	Если ЭтотОбъект.ЗавершениеСделки Тогда
	
		// Считаем ФР
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//	|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток) КАК СуммаОстаток,
		//	|	СУММА(ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстаток) КАК ВалютнаяСуммаОстаток
		//	|ИЗ
		//	|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		//	|			&Период,
		//	|			Счет В ИЕРАРХИИ (&Счет526),
		//	|			,
		//	|			Организация = &Организация
		//	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		//	|				И Субконто1 = &СПФИ
		//	|				И Валюта = &Валюта) КАК ЕдиныйБухгалтерскийУчетОстатки";
		//
		//Запрос.УстановитьПараметр("Период", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
		//Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		//Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		//Запрос.УстановитьПараметр("СВОП", ЭтотОбъект.СПФИ);
		//Запрос.УстановитьПараметр("Валюта", ЭтотОбъект.Валюта);
		//Запрос.УстановитьПараметр("Счет526", ПланыСчетов.Единый.ПроизводныеФинансовыеИнструменты);
		//
		//ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		//
		//	Если ВыборкаДетальныеЗаписи.СуммаОстаток > 0 Тогда // имели убыток ранее
		//		
		//		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ЭтотОбъект.ПроцентныйПлатежВходящий, "Списание себестоимости СВОПа");
		//		
		//		Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
		//		Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.СПФИ.Контрагент;
		//		Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.СПФИ;
		//		
		//		Проводка.ВалютаДт = ЭтотОбъект.Валюта;
		//		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.ПроцентныйПлатежВходящий;
		//		
		//		
		//		Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
		//		
		//	Иначе	
		//	
		//	КонецЕсли;
		//
		//КонецЕсли;
		
		
		// вернем номинал
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ЭтотОбъект.Основание.Номинал, "Номинал Основание");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.КорреспонденцияСАктивом;
		
		// кредит
		Проводка.СчетКт = УчетныйАктивЕПС.СчетУчетаТребованийПоПоставке;
		
		Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.Основание;
		Проводка.СубконтоКт.ОснованиеРасчетов = ЭтотОбъект.Основание;
		
		Проводка.ВалютаКт = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Основание.Номинал;
		
		Проводка.ДополнительнаяАналитикаКт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.НоминалСПФИ;
		
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ЭтотОбъект.Основание.Номинал, "Номинал Основание");
		
		// дебет
		Проводка.СчетДт = УчетныйАктивЕПС.СчетУчетаОбязательствПоПоставке;
		
		Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.Основание;
		Проводка.СубконтоДт.ОснованиеРасчетов = ЭтотОбъект.Основание;
		
		Проводка.ВалютаДт = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Основание.Номинал;
		
		Проводка.ДополнительнаяАналитикаДт = Справочники.ДополнительныеАналитикиЛицевыхСчетов.НоминалСПФИ;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Единый.КорреспонденцияСПассивом;
		
	КонецЕсли;
	
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);
	
	МассивУчетныхАктивов = Новый Массив;
	МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
	
	МассивСПФИ = Новый Массив;
	МассивСПФИ.Добавить(ЭтотОбъект.Основание);
	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Истина, Ложь, МассивСПФИ, Отказ);
	
	
КонецПроцедуры //ПроведениеПоРегиструЕПС

Процедура СформироватьПроводкуДвиженияДСБУНУ(ПараметрыПроводки)

	//СПФИ, УчетныйРегистр, Контрагент, СчетДС, СубконтоДС, СуммаДвиженияДС, Валюта, КоррСчет, ВидДвиженияДенежныхСредств, Описание
	
	Если ПараметрыПроводки.СуммаДвиженияДС > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[ПараметрыПроводки.УчетныйРегистр], ПараметрыПроводки.СуммаДвиженияДС, ПараметрыПроводки.Описание);
		
		СчетУчетаДС = ПараметрыПроводки.СчетДС;
		
		Проводка.СчетДт = СчетУчетаДС;
		
		ЕстьБрокер							= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено;
		ЕстьДоговорыБрокерскогоОбслуживания	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено;
		ЕстьВидДвиженияДС					= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено;
		ЕстьРасчетныйСчет                	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено;
		ЕстьВалютныйУчетДС					= СчетУчетаДС.Валютный;
		
		Если ЕстьБрокер Тогда
			Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
		КонецЕсли;
		
		Если ЕстьВидДвиженияДС Тогда
			Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = ПараметрыПроводки.СубконтоДС;
		КонецЕсли;	
		
		Если ЕстьВидДвиженияДС Тогда
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств 	= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссия;
		КонецЕсли;	
		
		Если ЕстьВалютныйУчетДС Тогда
			Проводка.ВалютаДт = ПараметрыПроводки.Валюта;
			Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.СуммаДвиженияДС;
		КонецЕсли;	
		
		Проводка.СчетКт = ПараметрыПроводки.КоррСчет;
		
		ЕстьКорКонтрагент	= ПараметрыПроводки.КоррСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено;
		ЕстьКорСделка	= ПараметрыПроводки.КоррСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено;
		
		ЕстьКорВалютныйУчетДС	= ПараметрыПроводки.КоррСчет.Валютный;
		
		Если ЕстьКорКонтрагент Тогда
			Проводка.СубконтоКт.Контрагенты = ПараметрыПроводки.Контрагент;
		КонецЕсли;	
		
		Если ЕстьКорСделка Тогда
			Проводка.СубконтоКт.Сделка = ПараметрыПроводки.СПФИ;
		КонецЕсли;	
		
		Если ЕстьКорВалютныйУчетДС Тогда
			Проводка.ВалютаКт = ПараметрыПроводки.Валюта;
			Проводка.ВалютнаяСуммаКт = ПараметрыПроводки.СуммаДвиженияДС;
		КонецЕсли;
		
	ИначеЕсли ПараметрыПроводки.СуммаДвиженияДС < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[ПараметрыПроводки.УчетныйРегистр], -ПараметрыПроводки.СуммаДвиженияДС, ПараметрыПроводки.Описание);
		
		Проводка.СчетДт = ПараметрыПроводки.КоррСчет;
		
		ЕстьКорКонтрагент	= ПараметрыПроводки.КоррСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено;
		ЕстьКорСделка	= ПараметрыПроводки.КоррСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено;
		
		ЕстьКорВалютныйУчетДС	= ПараметрыПроводки.КоррСчет.Валютный;
		
		Если ЕстьКорКонтрагент Тогда
			Проводка.СубконтоДт.Контрагенты = ПараметрыПроводки.Контрагент;
		КонецЕсли;	
		
		Если ЕстьКорСделка Тогда
			Проводка.СубконтоДт.Сделка = ПараметрыПроводки.СПФИ;
		КонецЕсли;	
		
		Если ЕстьКорВалютныйУчетДС Тогда
			Проводка.ВалютаДт = ПараметрыПроводки.Валюта;
			Проводка.ВалютнаяСуммаДт = -ПараметрыПроводки.СуммаДвиженияДС;
		КонецЕсли;
		
		СчетУчетаДС = ПараметрыПроводки.СчетДС;
		
		Проводка.СчетКт = СчетУчетаДС;
		
		ЕстьБрокер							= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено;
		ЕстьДоговорыБрокерскогоОбслуживания	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено;
		ЕстьВидДвиженияДС					= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено;
		ЕстьРасчетныйСчет                	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено;
		ЕстьВалютныйУчетДС					= СчетУчетаДС.Валютный;
		
		Если ЕстьБрокер Тогда
			Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
		КонецЕсли;
		
		Если ЕстьВидДвиженияДС Тогда
			Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = ПараметрыПроводки.СубконтоДС;
		КонецЕсли;	
		
		Если ЕстьВидДвиженияДС Тогда
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств 	= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссия;
		КонецЕсли;	
		
		Если ЕстьВалютныйУчетДС Тогда
			Проводка.ВалютаКт = ПараметрыПроводки.Валюта;
			Проводка.ВалютнаяСуммаКт = -ПараметрыПроводки.СуммаДвиженияДС;
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт 
	
	Движения[УчетныйРегистр].Записывать = Истина;
			
	СчетДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.Валюта,
		ЭтотОбъект.Брокер);
		
	СубконтоДС = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
	
	ПараметрыПроводкиДвиженияДС = Новый Структура();
	ПараметрыПроводкиДвиженияДС.Вставить("СПФИ", ЭтотОбъект.Основание);
	ПараметрыПроводкиДвиженияДС.Вставить("Контрагент", ЭтотОбъект.Основание.Контрагент);
	ПараметрыПроводкиДвиженияДС.Вставить("СчетДС", СчетДС);
	ПараметрыПроводкиДвиженияДС.Вставить("УчетныйРегистр", УчетныйРегистр);
	ПараметрыПроводкиДвиженияДС.Вставить("СубконтоДС", СубконтоДС);
	ПараметрыПроводкиДвиженияДС.Вставить("Валюта", ЭтотОбъект.Валюта);
	
	// Платеж входящий
	Если ЭтотОбъект.ПроцентныйПлатежВходящий > 0 Тогда
		
		ПараметрыПроводкиДвиженияДС.Вставить("СуммаДвиженияДС", ЭтотОбъект.ПроцентныйПлатежВходящий);
		ПараметрыПроводкиДвиженияДС.Вставить("КоррСчет", ПланыСчетов.Основной.ДепозитнаяМаржа);//76.31//47408 ПланыСчетов.Единый.Расчеты08);
		ПараметрыПроводкиДвиженияДС.Вставить("ВидДвиженияДенежныхСредств", Справочники.ВидыДвиженияДенежныхСредств.ПрочиеПоступления);
		ПараметрыПроводкиДвиженияДС.Вставить("Описание", "Проценты по СВОПу");
		
		СформироватьПроводкуДвиженияДСБУНУ(ПараметрыПроводкиДвиженияДС);
		
	КонецЕсли;
	
	// Платеж исходящий
	Если ЭтотОбъект.ПроцентныйПлатежИсходящий > 0 Тогда
		
		ПараметрыПроводкиДвиженияДС.Вставить("СуммаДвиженияДС", -ЭтотОбъект.ПроцентныйПлатежИсходящий);
		ПараметрыПроводкиДвиженияДС.Вставить("КоррСчет", ПланыСчетов.Основной.ДепозитнаяМаржа);//76.31//47407//ПланыСчетов.Единый.Расчеты07);
		ПараметрыПроводкиДвиженияДС.Вставить("ВидДвиженияДенежныхСредств", Справочники.ВидыДвиженияДенежныхСредств.ПрочиеВыплаты);
		ПараметрыПроводкиДвиженияДС.Вставить("Описание", "Проценты по СВОПу");
		
		СформироватьПроводкуДвиженияДСБУНУ(ПараметрыПроводкиДвиженияДС);
		
	КонецЕсли;

	// Отражаем доход/расход
	ТаблицаЦБ = Новый ТаблицаЗначений;
	ТаблицаЦБ.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип); 
	НовСтрока = ТаблицаЦБ.Добавить();
	НовСтрока.ЦеннаяБумага = ЭтотОбъект.Основание;
	
	СведенияОбОбращенииЦенныхБумагНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ(ЭтотОбъект.Дата, ЭтотОбъект.Ссылка, УчетныйРегистр, , ТаблицаЦБ);
	
	НайденныеСведенияОбОбращенииЦенныхБумагНаОРЦБ = СведенияОбОбращенииЦенныхБумагНаОРЦБ.Найти(ЭтотОбъект.Ссылка, "ЦеннаяБумага");
	
	Если ЗначениеЗаполнено(НайденныеСведенияОбОбращенииЦенныхБумагНаОРЦБ) Тогда
		ОбращаетсяНаОРЦБ = НайденныеСведенияОбОбращенииЦенныхБумагНаОРЦБ.ОбращаетсяНаОРЦБ;
	Иначе
		ОбращаетсяНаОРЦБ = Ложь;
	КонецЕсли;

	ФинРез = ЭтотОбъект.ПроцентныйПлатежВходящий - ЭтотОбъект.ПроцентныйПлатежИсходящий;
	
	Если ФинРез > 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ФинРез, "Доход по СВОПу");
		
		Проводка.СчетДт = ПланыСчетов.Основной.ДепозитнаяМаржа;//61601 ПланыСчетов.Единый.ВспомогательныеСчета01;
		Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Основание.Контрагент;
		Проводка.СубконтоДт.Сделка = ЭтотОбъект.Основание;
		
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;//71509_36204 УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ДепозитнаяМаржаВнереализационные");
		Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.Основание;
		Проводка.СубконтоКт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
		
	ИначеЕсли ФинРез < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], -ФинРез, "Расход по СВОПу");
	
		Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;//71510_46204 УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ДепозитнаяМаржаВнереализационные");
		Проводка.СубконтоДт.ЦенныеБумаги = ЭтотОбъект.Основание;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
		
		Проводка.СчетКт = ПланыСчетов.Основной.ДепозитнаяМаржа;//61601 ПланыСчетов.Единый.ВспомогательныеСчета01;
		Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Основание.Контрагент;
		Проводка.СубконтоКт.Сделка = ЭтотОбъект.Основание;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти
